Repository: pypi-data/pypi-mirror-345
Catalog: packages/limnoria/limnoria-2025.5.3.tar.gz/limnoria-2025.5.3/plugins/Conditional/locales/*.po
Languages: fi, it

source: Run a command from message, as if command was sent over IRC.
fi: Suorita komento viestistä, kuin komento olisi lähetetty IRC:stä.

source: <condition> <ifcommand> <elsecommand> Runs <ifcommand> if <condition> evaluates to true, runs <elsecommand> if it evaluates to false. Use other logical operators defined in this plugin and command nesting to your advantage here.
fi: <tilanne> <joskomento> <muutenkomento> Suorittaa <joskomennon> if <tilanne> kehittyy todeksi, suorittaa <muutenkomennon> jos se kehittyy epätodeksi. Käytä loogisia toimintoja, jotka on määritetty tässä laajennuksessa ja komentojen putkittamista eduksesi tässä.
it: <condizione> <comando_if> <comando_else> Esegue <comando_if> se <la condizione> analizzata è vera, esegue <comando_else> se falsa. Utilizza gli altri operatori logici presenti in questo plugin e i comandi nidificati a tuo vantaggio.

source: <cond1> [<cond2> ... <condN>] Returns true if all conditions supplied evaluate to true.
fi: <ehto1> [<ehto2> ... <ehtoN>] Palauttaa kaikki edellytykset jotka tukevat arviotumista todeksi.
it: <condizione1> [<condizione2> ... <condizioneN>] Restituisce True se tutte le condizioni fornite sono vere.

source: <cond1> [<cond2> ... <condN>] Returns true if any one of conditions supplied evaluates to true.
fi: <ehto1> [<ehto2> ... <ehtoN>] Palauttaa toden, jos yksikin edellytys tukee arvioimista todeksi.
it: <condizione1> [<condizione2> ... <condizioneN>] Restituisce True se almeno una delle condizioni fornite è vera.

source: <cond1> [<cond2> ... <condN>] Returns true if only one of conditions supplied evaluates to true.
fi: <ehto1> [<ehto2> ... <ehtoN>] Palauttaa toden, jos vain yksi edellytys tukee arvioimista todeksi.
it: <condizione1> [<condizione2> ... <condizioneN>] Restituisce True se solo una delle condizioni fornite è vera.

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if they are equal.
fi: <asia1> <asia2> Tekee ketju vertailun <asia1:teen> ja <asia2:teen>. Palauttaa toden jos ne ovat yhtäläisia.
it: <elemento1> <elemento2> Effettua una comparazione di stringhe tra <elemento1> ed <elemento2>. Restituisce True se sono uguali.

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if they are not equal.
fi: <asia1> <asia2> Tekee ketju vertailun <asiaan1> ja <asiaan2>. Palauttaa toden, jos ne eivät ole yhtäläisia.
it: <elemento1> <elemento2> Effettua una comparazione di stringhe tra <elemento1> ed <elemento2>. Restituisce True se non sono uguali.

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if <item1> is greater than <item2>.
fi: <asia1> <asia2> Tekee ketju vertailun <asiaan1> ja <asiaan2>. Palauttaa toden jos <asia1> on suurempi kuin <asia2>.
it: <elemento1> <elemento2> Effettua una comparazione di stringhe tra <elemento1> ed <elemento2>. Restituisce True se <elemento1> è maggiore di <elemento2>.

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if <item1> is greater than or equal to <item2>.
fi: <asia1> <asia2> Tekee ketju vertailun <asiaan1> ja <asiaan2>. Palauttaa toden jos <asia1> on suurempi tai yhtäläinen <asiaan2>.
it: <elemento1> <elemento2> Effettua una comparazione di stringhe tra <elemento1> ed <elemento2>. Restituisce True se <elemento1> è maggiore o uguale a <elemento2>.

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if <item1> is less than <item2>.
fi: <asia1> <asia2> Tekee ketju vertailun <asiaan1> ja <asiaan2>. Palauttaa toden jos <asia1> on vähemmän kuin <asia2>.
it: <elemento1> <elemento2> Effettua una comparazione di stringhe tra <elemento1> ed <elemento2>. Restituisce True se <elemento1> è minore di <elemento2>.

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if <item1> is less than or equal to <item2>.
fi: <asa1> <asia2> Tekee ketju vertailun <asiaan1> ja <asiaan2>. Palauttaa toden jos <asia1> on vähemmän tai yhtäläinen <asiaan2>.
it: <elemento1> <elemento2> Effettua una comparazione di stringhe tra <elemento1> ed <elemento2>. Restituisce True se <elemento1> è minore o uguale a <elemento2>.

source: [--case-insensitive] <item1> <item2> Determines if <item1> is a substring of <item2>. Returns true if <item1> is contained in <item2>. Will only match case if --case-insensitive is not given.
fi: [--case-insensitive] <kohde1> <kohde2> Selvittää onko <kohde1> osa <kohdetta2>. Palauttaa true, jos <kohde1> sisältyy <kohteeseen2>. Kirjainkoko merkitsee, mikäli --case-insensitive ei ole annettu.

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if they are equal.
fi: <asia1> <asia2> Tekee numerollisen vertailun <asian1> ja <asian2> välillä. Palauttaa toden, jos ne ovat yhtäläisiä.
it: <elemento1> <elemento2> Effettua una comparazione numerica tra <elemento1> ed <elemento2>. Restituisce True se sono uguali.

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if they are not equal.
fi: <asia1> <asia2> Tekee numerollisen vertailun <asiaan1> ja <asiaan2>. Palauttaa toden, jos ne eivät ole yhtäläisiä.
it: <elemento1> <elemento2> Effettua una comparazione numerica tra <elemento1> ed <elemento2>. Restituisce True se non sono uguali.

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if <item1> is greater than <item2>.
fi: <item1> <item2> Tekee numerollisen vertailun <asiaan1> ja <asiaan2>. Palauttaa toden jos <asia1> on suurempi kuin <asia2>.
it: <elemento1> <elemento2> Effettua una comparazione numerica tra <elemento1> ed <elemento2>. Restituisce True se <elemento1> è maggiore di <elemento2>.

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if <item1> is greater than or equal to <item2>.
fi: <item1> <item2> Tekee numerollisen vertailun <asiaan1> ja <asiaan2>. Palauttaa toden, jos <asia1> on suurempi tai yhtäläinen <asiaan2>.
it: <elemento1> <elemento2> Effettua una comparazione numerica tra <elemento1> ed <elemento2>. Restituisce True se <elemento1> è maggiore o uguale a <elemento2>.

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if <item1> is less than <item2>.
fi: <asia1> <asia2> Tekee numerollisen vertailun <asiaan1> ja <asiaan2>. Palauttaa toden jos <asia1> on vähemmän kuin <asia2>.
it: <elemento1> <elemento2> Effettua una comparazione numerica tra <elemento1> ed <elemento2>. Restituisce True se <elemento1> è minore di <elemento2>.

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if <item1> is less than or equal to <item2>.
fi: <asia1> <asia2> Tekee numerollisen vertailun <asiaan1> ja <asiaan2>. Palauttaa toden jos <asia1> on vähemmän tai yhtäläinen <asiaan2>.
it: <elemento1> <elemento2> Effettua una comparazione numerica tra <elemento1> ed <elemento2>. Restituisce True se <elemento1> è minore o uguale a <elemento2>.
