{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v3.18.0",
  "convertedBy": "H.A.W.K Prompt Enhancer",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "hawk_prompt_enhancer_model",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "name": "input_layer"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "name": "hidden_layer_1"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "name": "hidden_layer_2"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "softmax",
            "use_bias": true,
            "name": "output_layer"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": []
    }
  ],
  "signature": {
    "inputs": {
      "input_1": {
        "name": "input_1",
        "dtype": "float32",
        "shape": [null, 512]
      }
    },
    "outputs": {
      "output_1": {
        "name": "output_1",
        "dtype": "float32",
        "shape": [null, 32]
      }
    }
  }
} 