Repository: pypi-data/pypi-mirror-345
Catalog: packages/pretix-public-registrations/pretix_public_registrations-1.6.2-py3-none-any.whl/pretix_public_registrations/locale/*/LC_MESSAGES/django.po
Languages: de

source: Display public registrations for
de: Öffentliche Anmeldung für folgende Produkte anzeigen

source: Publicly display answers for
de: Öffentlich Antworten auf folgende Fragen anzeigen

source: Display attendee name
de: Teilnehmendenname anzeigen

source: Display product name
de: Produktname anzeigen

source: Public registration
de: Öffentliche Anmeldung

source: A gravatar image based on a hash of your e-mail address as well as the answers to the following questions will be publicly shown: %(qlist)s
de: Ein Gravatar-Bild basierend auf einem Hash deiner E-Mailadresse, sowie die Antworten auf folgende Fragen werden öffentlich angezeigt: %(qlist)s

source: Public registrations
de: Öffentliche Anmeldungen

source: No public registrations yet.
de: Noch keine öffentlichen Anmeldungen.

source: Public registrations settings
de: Einstellungen für öffentliche Anmeldungen

source: Display
de: Anzeige
