Repository: pypi-data/pypi-mirror-345
Catalog: packages/invenio-oauthclient/invenio_oauthclient-3.5.2-py2.py3-none-any.whl/invenio_oauthclient/translations/*/LC_MESSAGES/messages.po
Languages: es, it, sk

source: User ID
es: ID de usuario
it: ID Utente
sk: ID používateľa

source: Client ID
es: ID de cliente
it: ID Cliente
sk: ID klienta

source: ID Remote Account
es: ID de cuenta externa
it: ID Conto Esterno
sk: ID vzdialeného účtu

source: User Management
es: Gestión de usuarios
it: Gestione Utenti
sk: Správa používateľov

source: Linked accounts
es: Cuentas enlazadas
it: Conti legati
sk: Pripojené účty

source: Linked account tokens
es: Tokens de cuentas enlazadas

source: CERN account not allowed.
es: Cuenta CERN no permitida.

source: External service is already linked to another account.
es: El servicio externo ya está enlazado a otra cuenta.
it: Il servizio esterno è già collegato a un altro conto.
sk: Externá služba je už prepojená s iným účtom.

source: You rejected the authentication request.
es: Ha rechazado la solicitud de autenticación.
it: Hai rifiutato la richiesta d'autenticazione.
sk: Zamietli ste autentifikačnú požiadavku.

source: Authorization with remote service failed.
es: Error en la autorización con servicio remoto.
it: L'autorizzazione con il servizio esterno ha fallito.
sk: Autorizácia u vzdialenej služby zlyhala.

source: Sign in with %(title)s
es: Entrar con %(title)s
it: Registra con %(title)s
sk: Prihlásiť sa pomocou %(title)s

source: OR
es: O
it: O
sk: ALEBO

source: Sign-up with %(title)s!
es: Inscribirse con %(title)s!
it: Accedi con %(title)s
sk: Zaregistrovať sa pomocou %(title)s

source: Fill in your details to complete your registration. You only have to do this once.
es: Rellene sus datos para completar su registro. Sólo tiene que hacerlo una vez.
it: Completa i tuoi dettagli per finire la registrazione. Devi farlo una volta sola.
sk: Registráciu dokončíte vyplnením svojich údajov. Stačí tak urobiť raz.

source: Complete registration
es: Registro completo

source: Tired of entering password for %(sitename)s every time you sign in? Set up single sign-on with one or more of the services below:
es: ¿Cansado de introducir la contraseña en %(sitename)s cada vez que entra? Configure el inicio de sesión único con uno o más de los servicios siguientes:
it: Non vuoi inserire la password ogni volta che accedi a %(sitename)s? Configura un accesso unico con uno o più servizi di seguito:
sk: Už vás unavuje zadávať heslo do %(sitename)s pri každom prihlasovaní? Zriaďte si jednotné prihlásenie pomocou jednej alebo viacerých z nižšie uvedených služieb:

source: Disconnect
es: Desconectar
it: Scollega
sk: Odpojiť

source: Connect
es: Conectar
it: Collega
sk: Pripojiť

source: Or
es: O

source: %(icon)s Linked accounts
es: %(icon)s Cuentas enlazadas
it: %(icon)s Conti legati
sk: %(icon)s Pripojené účty
