Repository: pypi-data/pypi-mirror-345
Catalog: packages/limnoria/limnoria-2025.5.3.tar.gz/limnoria-2025.5.3/plugins/Karma/locales/*.po
Languages: fi

source: Determines whether the bot will output shorter versions of the karma output when requesting a single thing's karma.
fi: Määrittää tulostaako botti lyhyemmän version karma ulostulosta, kun pyydetään yhden asian karmaa.

source: A space separated list of characters to increase karma.
fi: Välilyönneillä eroitettu lista merkeistä, jotka nostavat karmaa.

source: A space separated list of characters to decrease karma.
fi: Välilyöneillä eroitettu lista merkeistä, jotka laskevat karmaa.

source: Determines whether the bot will reply with a success message when something's karma is increased or decreased.
fi: Määrittää vastaako botti onnistumisviestillä, kun jonkin karmaa on nostettu tai laskettu.

source: Determines how many highest/lowest karma things are shown when karma is called with no arguments.
fi: Määrittää kuinka monta korkeinta/matalinta karma asiaa näytetään, kun karma pyydetään ilman parametriä.

source: Determines how many karma things are shown when the most command is called.
fi: Määrittää kuinka monta karma asiaa näytetään, kun kun "most" komento on pyydetty.'

source: Determines whether users can adjust the karma of their nick.
fi: Määrittää pystyvätkö käyttäjän määrittämään nimimerkkinsä karman.

source: Determines whether the bot will increase/decrease karma without being addressed.
fi: Määrittää nostaako/vähentääkö botti karmaa ilman, että sille tarkoitetaan viestejä.

source: %(thing)s's karma is now %(karma)i
fi: %(thing)in karma on nyt %(karma)i

source: You're not allowed to adjust your own karma.
fi: Sinä et saa määrittää omaa karmaasi.

source: [<channel>] [<thing> ...] Returns the karma of <thing>. If <thing> is not given, returns the top N karmas, where N is determined by the config variable supybot.plugins.Karma.rankingDisplay. If one <thing> is given, returns the details of its karma; if more than one <thing> is given, returns the total karma of each of the things. <channel> is only necessary if the message isn't sent on the channel itself.
fi: [<Kanava>] [<asia> ...] Palauttaa <asian> karman. Jos <asiaa> ei ole annettu, palauttaa TOP N karmat, missä N on asetusarvon supybot.plugins.Karma.rankingDisplay määrittämä. Jos yksi <asia> on annettu, palauttaa tiedot sen karmasta; jos useampi kuin yksi <asia> on annettu, tarkistaa jokaisen asian yhteiskarman. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: %s has neutral karma.
fi: %s:llä on neutraali karma.

source: Karma for %q has been increased %n and decreased %n for a total karma of %s.
fi: Karma %q:lle on noussut %n ja laskenut %n yhteiskarmalle %s.

source: time
fi: aika

source: I didn't know the karma for any of those things.
fi: Minä en tiennyt yhtäkään noiden asioiden karmoista.

source: I have no karma for this channel.
fi: Minulla ei ole karmaa tälle kanavalle.

source: You (%s) are ranked %i out of %i.
fi: Sinä olet rankingissa (%s) %i %i:stä.

source: Highest karma: %L. Lowest karma: %L.%s
fi: Korkein karma: %L. Alhaisin karma: %L.%s

source: [<channel>] {increased,decreased,active} Returns the most increased, the most decreased, or the most active (the sum of increased and decreased) karma things. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] {increased,decreased,active} Palauttaa eniten nousseen ("increased"), eniten laskeneen ("decreased"), tai aktiivisimman ("active") (nousseiden ja laskeneiden) karma asiat. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] [<name>] Resets the karma of <name> to 0. If <name> is not given, resets everything.
fi: [<kanava>] <nimi> Asettaa <nimen> karman arvoksi 0. Jos <nimeä> ei ole annettu, asettaa kaiken arvoksi 0.

source: [<channel>] <filename> Dumps the Karma database for <channel> to <filename> in the bot's data directory. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <tiedostonimi> Tallentaa <kanavan> <tiedostonimeen> botin "data" hakemistoon. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <filename> Loads the Karma database for <channel> from <filename> in the bot's data directory. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <tiedostonimi> Lataa Karma tietokannan <kanavalle> <tiedostonimestä> botin "data" hakemistosta. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
