Repository: pypi-data/pypi-mirror-345
Catalog: packages/invenio-oauthclient/invenio-oauthclient-3.5.2.tar.gz/invenio-oauthclient-3.5.2/invenio_oauthclient/translations/*/LC_MESSAGES/messages.po
Languages: et, fr, hu, zh_cn

source: ID
zh_cn: 身份证明

source: User ID
fr: ID d'Utilisateur
hu: Felhasználói azonosító
zh_cn: 用户ID

source: Client ID
et: Kliendi ID
fr: ID de Client
hu: Kliens ID
zh_cn: 客户端ID

source: ID Remote Account
et: ID Kaugkonto
fr: ID du Compte Externe
hu: ID Távolsági Felhasználói fiók
zh_cn: 远程帐户ID

source: User Management
et: Kasutajate haldus
fr: Gestion Utilisateur
hu: Felhasználók kezelése
zh_cn: 用户管理

source: Linked accounts
et: Seotud kontod
fr: Comptes liés
hu: Kapcsolódó fiókok
zh_cn: 关连帐户

source: Linked account tokens
et: Seotud kontode ligipääsutõendid
hu: Kapcsolt fióktokenek
zh_cn: 关连帐户代币

source: CERN account not allowed.
et: CERN-i konto pole lubatud.
hu: A CERN fiók nem engedélyezett.
zh_cn: 不允许使用CERN帐户。

source: External service is already linked to another account.
et: Väline teenus on juba teise kontoga seotud.
fr: Le service externe est déjà lié à un autre compte.
hu: A külső szolgáltatás már kapcsolva van egy másik felhasználói fiókhoz.
zh_cn: 外部服务已经链接到另一个帐户。

source: You rejected the authentication request.
et: Lükkasite autentimise nõude tagasi.
fr: Vous avez rejeté la demande d'authentification.
hu: Ön elutasította a hitelesítési kérést.
zh_cn: 您拒绝了身份验证请求。

source: Authorization with remote service failed.
et: Autoriseerimine kaugteenuse jaoks ebaõnnestus.
fr: Echec de l'autorisation du service externe.
hu: A távolsági szolgáltatás engedélyezése meghiúsult.
zh_cn: 远程服务授权失败。

source: Sign in with %(title)s
et: Logi sisse %(title)s
fr: Inscription avec %(title)s
hu: Belépés ezzel: %(title)s
zh_cn: 使用%(title)s登录

source: OR
et: VÕI
fr: OU
hu: VAGY
zh_cn: 或

source: Sign-up with %(title)s!
et: Loo konto %(title)s!
fr: Connexion avec %(title)s!
hu: Regisztráció ezzel: %(title)s!
zh_cn: 注册%(title)s！

source: Fill in your details to complete your registration. You only have to do this once.
et: Registreerimise lõpule viimiseks täida väljad oma andmetega. Seda tuleb teha ainult üks kord.
fr: Remplissez vos informations pour compléter votre inscription. Vous n'aurez à faire ceci qu'une fois.
hu: Töltse ki az adatokat a regisztráció befejezéséhez! Ezt csak egyszer kell megtennie.
zh_cn: 填写您的详细信息以完成注册。你只需要做一次。

source: Complete registration
et: Vii registreerimine lõpuni
hu: Regisztráció befejezése
zh_cn: 完成注册

source: Tired of entering password for %(sitename)s every time you sign in? Set up single sign-on with one or more of the services below:
et: Kas oled tüdinud iga kord %(sitename)s sisselogimisel parooli sisestamisest? Seadista ühekordne sisselogimine ühe või mitme alloleva teenusega:
fr: Vous n'avez pas envie d'entrer votre mot de passe pour %(sitename)s à chaque fois que vous vous connectez? Etablissez une connexion unique avec un ou plusieurs des services ci-dessous:
hu: Elege van, hogy a %(sitename)s felhasználónévhez mindig jelszavat írjon be? Állítson be egyszerű belépést az alábbi szolgáltatás(ok) segítségével:
zh_cn: 厌倦了每次登录%(sitename)s都输入密码？使用以下一项或多项服务设置单点登录：

source: Disconnect
et: Katkesta ühendus
fr: Déconnexion
hu: Kapcsolat bontása
zh_cn: 断开连接

source: Connect
et: Ühenda
fr: Connexion
hu: Kapcsolódás
zh_cn: 连接

source: Or
et: Või
hu: Vagy
zh_cn: 或

source: %(icon)s Linked accounts
et: %(icon)s Seotud kontod
fr: %(icon)s Comptes liés
hu: %(icon)s kapcsolt fiók
zh_cn: %(icon)s关联账户
