Repository: pypi-data/pypi-mirror-345
Catalog: packages/limnoria/limnoria-2025.5.3.tar.gz/limnoria-2025.5.3/plugins/QuoteGrabs/locales/*.po
Languages: fi

source: Determines whether the bot will randomly grab possibly-suitable quotes on occasion. The suitability of a given message is determined by ...
fi: Määrittää kaappaako botti sattumanvaraisesti mahdollisesti sopivia lainauksia. Annetun viestin sopivuuden määrittää ...

source: Determines about how many seconds, on average, should elapse between random grabs. This is only an average value; grabs can happen from any time after half this time until never, although that's unlikely to occur.
fi: Määrittää kuinka monta sekuntia keskiarvona, pitäisi kulua kaappausten välissä. Tämä on vain keskiarvo; kaappaukset voivat tapahtua milloin tahansa, kun puolet tästä ajasta on kulunut ikuisuuteen asti, mutta sitä tuskin tapahtuu.

source: Determines the minimum number of words in a message for it to be considered for random grabbing.
fi: Määrittää minimimäärän sanoja viestissä, joita pidetään kaappaukseen soveltuvina.

source: Determines the minimum number of characters in a message for it to be considered for random grabbing.
fi: Määrittää minimimäärän merkkejä ennen kuin sitä harkitaan sopivaksi satunnaiselle kaappaamiselle.

source: %s (Said by: %s; grabbed by %s at %t)
fi: %s (Sanonut: %s; kaapannut %s kello %t)

source: Stores and displays quotes from channels. Quotes are stored randomly and/or on user request.
fi: Tallentaa ja näyttää lainauksia, jotka on kaapattu kanavilta. Lainauksia tallennetaan sattumanvaraisesti ja/tai käyttäjän pyytäessä sitä.

source: [<channel>] <nick> Grabs a quote from <channel> by <nick> for the quotegrabs table. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <nimimerkki> Kaappaa lainauksen, jonka <nimimerkki> on sanonut <kanavalla> lainaus kaappaus tietokantaan. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: You can't quote grab yourself.
fi: Et voi kaapata lainausta itseltäsi.

source: I couldn't find a proper message to grab.
fi: En voinut löytää kelvollista viestiä kaapattavaksi.

source: [<channel>] <number> Removes the grab <number> (the last by default) on <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <numero> Poistaa kaappauksen <numero> (oletuksena viimeinen) <kanavalta>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: Nothing to ungrab.
fi: Ei mitään kaappausta poistettavaksi.

source: Invalid grab number.
fi: Epäkelvollinen kaappauksen numero.

source: [<channel>] <nick> Returns <nick>'s latest quote grab in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <nimimerkki> Palauttaa <nimimerkin> viimeisimmän lainauksen kaappauksen <kanavalla>. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: I couldn't find a matching quotegrab for %s.
fi: En voinut löytää täsmäävää lainaus kaappausta %s:lle.

source: [<channel>] <nick> Returns a list of shortened quotes that have been grabbed for <nick> as well as the id of each quote. These ids can be used to get the full quote. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <nimimerkki> Palauttaa listan lyhennetyistä lainauksista, jotka on kaapattu <nimimerkitä>, kuten myös jokaisen lainauksen id:een. Näitä id:eitä voidaan käyttää koko lainauksen saamiseen. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: I couldn't find any quotegrabs for %s.
fi: En voinut löytää yhtään kaapattuja lainauksia %s:ltä.

source: [<channel>] [<nick>] Returns a randomly grabbed quote, optionally choosing only from those quotes grabbed for <nick>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] [<nimimerkki>] Palauttaa satunnaisen lainatun kaappauksen, vaihtoehtoisesti valiten vain lainauksista, jotka on kaapattu <nimimerkiltä>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: Couldn't get a random quote for that nick.
fi: Satunnaista lainausta tuolta nimimerkiltä ei voitu noutaa.

source: Couldn't get a random quote. Are there any grabbed quotes in the database?
fi: Satunnaista lainausta ei voitu noutaa. Onko tietokannassa yhtään kaapattuja lainauksia?

source: [<channel>] <id> Return the quotegrab with the given <id>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <id> Palauttaa kaapatun lainauksen annetulla <id:llä>. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: No quotegrab for id %s
fi: Ei kaapattuja lainauksia %s:lle.

source: [<channel>] <text> Searches for <text> in a quote. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <teksti> Etsii <tekstiä> lainauksesta. <Kanava> on vaadittu vain, jos viestiä viestiä ei lähetetä kanavalla itsellään.

source: No quotegrabs matching %s
fi: Ei %s:ään täsmääviä lainauksia
