Repository: pypi-data/pypi-mirror-345
Catalog: packages/limnoria/limnoria-2025.5.3.tar.gz/limnoria-2025.5.3/plugins/AutoMode/locales/*.po
Languages: fi

source: Determines whether this plugin is enabled.
fi: Määrittää onko tämä lisäosa käytössä.

source: Determines whether this plugin will automode owners even if they don't have op/halfop/voice/whatever capability.
fi: Määrittää vaihtaako botti omistajien tilaa automaattisesti, vaikka heillä ei olisi op/halfop/voice/ihansama valtuutta.

source: Determines whether the bot will check for 'alternative capabilities' (ie. autoop, autohalfop, autovoice) in addition to/instead of classic ones.
fi: Määrittää tarkistaako botti 'vaihtoehtoisten valtuuksien' varalta (esim. autoop, autohalfop, autovoice) klassisten lisäksi/sijaan.

source: Determines whether the bot will "fall through" to halfop/voicing when auto-opping is turned off but auto-halfopping/voicing are turned on.
fi: Määrittää "alentuuko" botti halfoppaamiseen/voicen antamiseen kun automaattinen oprtaattori aseman antaminen on poistettu käytöstä, mutta automaattinen puolioperaattori aseman/äänen antaminen on käytössä.

source: Determines whether the bot will automatically op people with the <channel>,op capability when they join the channel.
fi: Määrittää oppaako botti ihmiset, joilla on #<kanava>,op valtuus automaattisesti, kun he liittyvät kanavalle.

source: Determines whether the bot will automatically halfop people with the <channel>,halfop capability when they join the channel.
fi: Määrittää antaako botti puolioperaattorin aseman automaattisesti, kun ihmiset, joilla on #<kanava>,halfop valtuus liittyvät kanavalle.

source: Determines whether the bot will automatically voice people with the <channel>,voice capability when they join the channel.
fi: Määrittää antaako botti automaattisesti äänen ihmisille, joilla on #<kanava>,voice valtuus heidän liittyessään kanavalle.

source: Determines whether the bot will automatically ban people who join the channel and are on the banlist.
fi: Määrittää antaako botti porttikiellon ihmisille, jotka liittyvät kanavalle ja ovat porttikieltolistalla.

source: Determines how many seconds the bot will automatically ban a person when banning.
fi: Määrittää kuinka moneksi sekuntiksi botti antaa porttikiellon henkilöle, antaessaan porttikieltoa automaattisesti.

source: Determines how many seconds the bot will wait before applying a mode. Has no effect on bans.
fi: Määrittää kuinka monta sekuntia botti odottaa ennen, kuin asettaa tilan. Tällä ei ole vaikutusta porttikieltoihin.

source: Extra modes that will be applied to a user. Example syntax: user1+o-v user2+v user3-v
fi: Ylimääräiset tilat, jotka asetetaan käyttäjään. Esimerkki syntaksi: käyttäjä1+o-v käyttäjä2+v käyttäjä3-v

source: Determines whether or not a mode has already been applied.
fi: Määrittää asettaako botti tilan vai eikö, jos tila se on jo asetettu.
