Repository: pypi-data/pypi-mirror-345
Catalog: packages/limnoria/limnoria-2025.5.3.tar.gz/limnoria-2025.5.3/plugins/Topic/locales/*.po
Languages: it

source: Value must include $topic, otherwise the actual topic would be left out.
it: Il valore deve includere $topic, altrimenti l'attuale topic non sarà modificato.

source: Determines what separator is used between individually added topics in the channel topic.
it: Determina quale separatore utilizzare tra i diversi argomenti del topic del canale.

source: Determines what format is used to add topics in the topic. All the standard substitutes apply, in addition to "$topic" for the topic itself.
it: Determina quale formato utilizzare per aggiungere argomenti al topic. In aggiunta a "$topic" per il topic stesso, sono applicati tutti gli standard di sostituzione.

source: Determines whether the bot will recognize the TOPICLEN value sent to it by the server and thus refuse to send TOPICs longer than the TOPICLEN. These topics are likely to be truncated by the server anyway, so this defaults to True.
it: Determina se il bot riconoscerà il valore di TOPICLEN inviato dal server e rifiuterà di inviare topic di lunghezza maggiore. I topic troppo lunghi saranno comunque troncati dal server, per cui è impostato a True in modo predefinito.

source: Determines what the default topic for the channel is. This is used by the default command to set this topic.
it: Determina quale sia il topic predefinito del canale. È utilizzato dal comando "default".

source: Determines the number of previous topics to keep around in case the undo command is called.
it: Determina il numero di topic precedenti da ricordare in caso si utilizzi il comando "undo".

source: Determines the capabilities required (if any) to make any topic changes, (everything except for read-only operations). Use 'channel,capab' for channel-level capabilities. Note that absence of an explicit anticapability means user has capability.
it: Determina le capacità richieste (eventuali) per le modifiche al topic (qualsiasi operazione tranne la lettura). Utilizzare "canale,capacità" per le capacità del singolo canale. L'assenza di un'esplicita anti-capacità significa che l'utente può usare i comandi.

source: I'm not currently in %s.
it: Attualmente non sono in %s.

source: The topic must not include %q.
it: Il topic non deve includere %q.

source: topic number
it: numero dell'argomento

source: There are no topics in %s.
it: Non ci sono argomenti in %s.

source: That topic is too long for this server (maximum length: %i; this topic: %i).
it: Il topic è troppo lungo per il server (lunghezza massima: %i; questo: %i).

source: Check if the user has any of the required capabilities to manage the channel topic. The list of required capabilities is in requireManageCapability channel config. Also allow if the user is a chanop. Since they can change the topic manually anyway.
it: Controlla che l'utente abbia una delle capacità richieste per gestire il topic del canale. L'elenco delle capacità è nella variabile di configurazione requireManageCapability. Autorizza anche un operatore del canale, dal momento che potrebbe comunque farlo manualmente.

source: [<channel>] Returns the topic for <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] Restituisce il topic di <canale>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] <topic> Adds <topic> to the topics for <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] <argomento> Aggiunge <argomento> al topic di <canale>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] <topic> Adds <topic> to the topics for <channel>. If the topic is too long for the server, topics will be popped until there is enough room. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] <argomento> Aggiunge <argomento> al topic di <canale>. Se il topic è troppo lungo per il server, gli argomenti saranno tagliati per rientrare nel limite. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] <number> <topic> Replaces topic <number> with <topic>.
it: [<canale>] <numero> <argomento> Sostituisce argomento <numero> con <argomento>.

source: [<channel>] <topic> Adds <topic> to the topics for <channel> at the beginning of the topics currently on <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] <argomento> Aggiunge <argomento> al topic di <canale> all'inizio dello stesso. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] Shuffles the topics in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] Mescola gli argomenti del topic di <canale>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: I can't shuffle 1 or fewer topics.
it: Non posso mescolare uno o pochi argomenti.

source: [<channel>] <number> [<number> ...] Reorders the topics from <channel> in the order of the specified <number> arguments. <number> is a one-based index into the topics. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] <numero> [<numero> ...] Riordina gli argomenti del topic di <canale> nell'ordine specificato da <numero>, dove <numero> è un indice di argomenti. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: I cannot reorder 1 or fewer topics.
it: Non posso riordinare uno o pochi argomenti.

source: All topic numbers must be specified.
it: Bisogna specificare tutti i numeri degli argomenti.

source: Duplicate topic numbers cannot be specified.
it: Impossibile specificare numeri di argomenti doppi.

source: [<channel>] Returns a list of the topics in <channel>, prefixed by their indexes. Mostly useful for topic reordering. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] Riporta un elenco degli argomenti di <canale>, con il proprio indice come prefisso; essenzialmente utile per riordinare gli argomenti. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] <number> Returns topic number <number> from <channel>. <number> is a one-based index into the topics. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] <numero> Restituisce l'argomento <numero> di <canale>, dove <numero> è un indice di argomenti. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] <number> <regexp> Changes the topic number <number> on <channel> according to the regular expression <regexp>. <number> is the one-based index into the topics; <regexp> is a regular expression of the form s/regexp/replacement/flags. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] <numero> <regexp> Modifica l'argomento <numero> di <canale> in base a <regexp>. <numero> è un indice di argomenti e <regexp> un'espressine regolare nella forma s/regexp/sostituzione/flag. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] [<number>] <topic> Sets the topic <number> to be <text>. If no <number> is given, this sets the entire topic. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] [<numero>] <argomento> Definisce l'argomento <numero>. Se <numero> non è specificato imposta l'intero topic. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] Locks the topic (sets the mode +t) in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] Blocca il topic (imposta il mode +t) in <canale>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: lock the topic
it: bloccare il topic

source: [<channel>] Unlocks the topic (sets the mode -t) in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] Sblocca il topic (imposta il mode -t) in <canale>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: unlock the topic
it: sbloccare il topic

source: [<channel>] Restores the topic to the last topic set by the bot. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] Ripristina il topic all'ultimo impostato dal bot. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: I haven't yet set the topic in %s.
it: Non ho ancora impostato il topic in %s.

source: [<channel>] Restores the topic to the one previous to the last topic command that set it. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] Ripristina il topic a quello precedente all'ultimo impostato dal comando "topic". <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: There are no more undos for %s.
it: Non ci sono più annullamenti per %s.

source: [<channel>] Undoes the last undo. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canalel>] Annulla l'ultimo ripristino. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: There are no redos for %s.
it: Non ci sono ripristini per %s.

source: [<channel>] <first topic number> <second topic number> Swaps the order of the first topic number and the second topic number. <channel> is only necessary if the message isn't sent in the channel itself.
it: [<canale>] <numero primo argomento> <numero secondo argomento> Scambia l'ordine del numero del primo argomento con il secondo. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: I refuse to swap the same topic with itself.
it: Mi rifiuto di scambiare l'argomento con lo stesso.

source: [<channel>] Sets the topic in <channel> to the default topic for <channel>. The default topic for a channel may be configured via the configuration variable supybot.plugins.Topic.default.
it: [<canale>] Imposta il topic in <canale> a quello predefinito. Il topic predefinito per un canale può essere configurato tramite la variabile di configurazione supybot.plugins.Topic.default.

source: There is no default topic configured for %s.
it: Non c'è un topic predefinito configurato per %s.

source: [<channel>] <separator> Sets the topic separator for <channel> to <separator> Converts the current topic appropriately.
it: [<canale>] <separatore> Imposta il separatore per gli argomenti del topic di <canale>. Converte l'attuale topic di conseguenza.
