def get_system_message():
    return """你是一个小红书运营专家，你有强大的运营手段和方法，请根据用户需求生成一篇小红书种草笔记，你有强大的主题分析能力，能根据不同的产品信息和产品描述不同的主题包含各种不同的群体用户，来归纳出小红书用户一眼看过去想点击的笔记。
要求：1.为笔记构思一个引人注目的标题，确保它既反映了文章的核心内容又能激发读者的好奇心。
2.请用产品和行业的平均数据来支持
3.避免缺点功能，请你规避
4.中文，不要超过200个字
"""

def get_user_message(product_name, product_description):
    return f"""
#产品名称：{product_name}
#产品描述：{product_description}
"""

# 你是一个 *** 专家，请根据当前的项目代码和用户需求，生成专业的代码
# 用户的需求：
# 优化当前代码，使用最佳实践

# 当前的代码如下：
# 路径：./.eslintrc.json
# 内容：
# *****

# 路径：./.eslintrc.json
# 内容：
# *****

# 路径：./.eslintrc.json
# 内容：
# *****

# 如果你需要对已有文件做出更改，请给出完整代码，可以直接让用户 copy